using System.Collections.Generic;

namespace Milvaneth.Communication.Vendor
{
    public class MessageVendor
    {
        public static Dictionary<int, string> MessageBody = new Dictionary<int, string>
        {
            // 00: Success
            [00_0000] = "成功",
            [00_0001] = "下一步",
            [00_0002] = "完成",
            [00_0003] = "请求验证",
            [00_0004] = "可用更新",

            // 01: Limit
            [01_0000] = "请重试",
            [01_0001] = "频率限制，请稍后重试",
            [01_0002] = "系统超荷，请稍后重试",
            [01_0003] = null, // retry with pow

            // 02: Generic Error
            [02_0000] = "本地程序错误",
            [02_0001] = "网络连接无响应",
            [02_0002] = "网络连接超时",
            [02_0003] = "无法连接网络",
            [02_0004] = "不是合法的API访问点",
            [02_0005] = "不是合法的URL格式",
            [02_0006] = "无法访问该API访问点",
            [02_0007] = "服务器数据异常",
            [02_0008] = "无权调用本流程",
            [02_0009] = "本地流程失序",
            [02_0400] = "请求格式错误",
            [02_0401] = "未进行身份认证",
            [02_0403] = "禁止访问",
            [02_0404] = "无法找到资源",
            [02_0408] = "请求超时",
            [02_0418] = "成功",
            [02_0429] = "频率限制，请稍后重试",
            [02_0451] = "根据相关法律法规，目前无法提供服务",
            [02_0500] = "服务器内部错误",
            [02_0502] = "服务器网络错误",
            [02_0503] = "维护中，目前无法提供服务",
            [02_0504] = "服务器网络超时",
            [02_0511] = null, // token renew required
            [02_0520] = "未知CDN错误",
            [02_0522] = "CDN超时",
            [02_0523] = "CDN错误",

            // 03: Data Error
            [03_0000] = "请重试注册",
            [03_0001] = "无效的用户名",
            [03_0002] = "用户名已被注册",
            [03_0003] = "无效的用户昵称",
            [03_0004] = "根据相关法律法规，该用户昵称不可用",
            [03_0005] = "邮箱格式错误",
            [03_0006] = "该邮箱服务商不可用",
            [03_0007] = "密码强度不足",
            [03_0008] = "无法获取必要信息",
            [03_0009] = null, // data unavailable
            [03_0010] = "无效输入",
            [03_0011] = "无效的验证码",
            [03_0012] = "输入与记录不符",
            [03_0013] = "用户名不存在",
            [03_0014] = "本账户无法使用邮箱找回",
            [03_0015] = "请使用常用环境进行找回",

            // 04: Invalid Operation
            [04_0000] = "缺少 Token",
            [04_0001] = "无效 Token",
            [04_0002] = "数据错误",
            [04_0003] = "无效操作",
            [04_0004] = "Karma 不足",
            [04_0005] = "由于近期存在异常的账户操作，暂时无法进行登录",
            [04_0006] = "很抱歉，暂时无法访问服务",
            [04_0007] = "您的操作过于频繁，请休息一下",
            [04_0511] = null, // token renew required
            [04_4625] = "0xC0000072", // STATUS_ACCOUNT_DISABLED for talented super hackers
        };

        public static string FormatError(int code)
        {
            if (code / 10000 == 0)
                return null;

            if (MessageBody.TryGetValue(code, out var msg))
                return msg != null ? $"[{(code / 10000):D2}][{(code % 10000):D4}] {msg}" : null;

            return $"[{(code / 10000):D2}][{(code % 10000):D4}] 未知状态码";
        }
    }
}
